app/views/gossip/show.html.erb

    <br>
    <span> Balancé par </span><a href="/author/<%= @gossip.user_id %>"><%= @gossip.user.first_name %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  <h2>All comments :</h2>
    <% @gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 4]]