app/controllers/author_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
def show
    @user = User.find(params["id"])
    @gossips = Gossip.all