app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def create
    @gossip = Gossip.find(params[:gossip_id])