app/controllers/gossip_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 4]]
---
  def show
    @comment = Comment.where(gossip_id: @gossip.id)

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "vv"], ["created_at", "2020-02-13 15:05:25.474063"], ["updated_at", "2020-02-13 15:05:25.474063"]]
INSERT INTO "users" ("first_name", "last_name", "email", "age", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "titre 1"], ["content", "sqfqs"], ["user_id", 4], ["created_at", "2020-02-11 10:50:11.246069"], ["updated_at", "2020-02-11 10:50:11.246069"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 27]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 8]]
---
  def create
    @city = City.create(name: params[:city])
    @user = User.create(age: params[:age], first_name: params[:first_name], last_name: params[:last_name], email: params[:email], city_id: @city.id)
    @gossip = Gossip.new(user_id: @user.id, content: params[:content], title: params[:title]) # avec xxx qui sont les données obtenues à partir du formulaire
    if @gossip.save # essaie de sauvegarder en base @gossip
      @success = true
      render "gossip/new"
    else
      @city.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params["id"])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4
---
  def update
    @gossip = Gossip.find(params["id"])
    gossip_params = params.require(:gossip).permit(:title, :content)
    @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 2]]
---
  def destroy
    @gossip = Gossip.find(params["id"])
    @gossip.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_post
  @gossip = Gossip.find(params[:id])