app/views/cities/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."city_id" = $1 LIMIT $2  [["city_id", 6], ["LIMIT", 1]]
---
          <% @gossip.each do |gossip| %>
          <% if User.find_by(city: @city.id).id == gossip.user.id then %>