app/views/profil/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
</div>
<h2>Salut <%= User.find_by(id: session[:user_id]).first_name %> ! Ca fait plaisir de te voir ici</h2>